//Luca (Lucía) Vásquez González (88254/8)

void setup () {
  size (500,500);
  background (70,191,255);
}
void draw () {
  fill (69,180,25);
  rect (0,300,500,200);
  fill (100,65,17);
  rect (10,200,30,150);
  fill (17,100,33);
  triangle (-20,250,25,180,80,250);
  triangle (-20,220,25,160,80,220);
  triangle (-20,190,25,140,80,190);
  fill (239,245,94);
  rect (125,200,250,250);
  fill (255,0,0);
  triangle (100,200,250,50,400,200);
  fill (149,100,77);
  rect (210,320,80,130);
  fill (255,247,8);
  ellipse (500,0,200,200);
  fill (149,100,77);
  ellipse (280,390,10,10);
}
